Autodesk.Revit.DB.ParameterType
An enumerated type listing all of the data type interpretation that Autodesk Revit supports.

Autodesk.Revit.DB.ParameterType.ElectricalTemperatureDifference
The data value will be represented as an ElectricalTemperatureDifference.

Autodesk.Revit.DB.ParameterType.PipingTemperatureDifference
The data value will be represented as a PipingTemperatureDifference.

Autodesk.Revit.DB.ParameterType.HVACTemperatureDifference
The data value will be represented as a HVACTemperatureDifference.

Autodesk.Revit.DB.ParameterType.PipeMassPerUnitLength
The value of this parameter will be the Pipe Mass per Unit Length

Autodesk.Revit.DB.ParameterType.PipeMass
The value of this parameter will be the Pipe Mass

Autodesk.Revit.DB.ParameterType.PipeDimension
The value of this parameter will be a Pipe Dimension

Autodesk.Revit.DB.ParameterType.MassPerUnitArea
The data value will be represented as a MassPerUnitArea.

Autodesk.Revit.DB.ParameterType.MassDensity
The data value will be represented as a MassDensity.

Autodesk.Revit.DB.ParameterType.ElectricalResistivity
The data value will be represented as a ElectricalResistivity.

Autodesk.Revit.DB.ParameterType.HVACPermeability
The data value will be represented as a HVACPermeability.

Autodesk.Revit.DB.ParameterType.HVACSpecificHeatOfVaporization
The data value will be represented as a HVACSpecificHeatOfVaporization.

Autodesk.Revit.DB.ParameterType.HVACSpecificHeat
The data value will be represented as a HVACSpecificHeat.

Autodesk.Revit.DB.ParameterType.HVACThermalConductivity
The data value will be represented as a HVACThermalConductivity.

Autodesk.Revit.DB.ParameterType.WeightPerUnitLength
The data value will be represented as a WeightPerUnitLength.

Autodesk.Revit.DB.ParameterType.Weight
The data value will be represented as a Weight.

Autodesk.Revit.DB.ParameterType.WarpingConstant
The data value will be represented as a WarpingConstant.

Autodesk.Revit.DB.ParameterType.StructuralVelocity
The data value will be represented as a StructuralVelocity.

Autodesk.Revit.DB.ParameterType.SectionProperty
The data value will be represented as a SectionProperty.

Autodesk.Revit.DB.ParameterType.SectionModulus
The data value will be represented as a SectionModulus.

Autodesk.Revit.DB.ParameterType.SectionDimension
The data value will be represented as a SectionDimension.

Autodesk.Revit.DB.ParameterType.SectionArea
The data value will be represented as a SectionArea.

Autodesk.Revit.DB.ParameterType.Rotation
The data value will be represented as a Rotation.

Autodesk.Revit.DB.ParameterType.ReinforcementSpacing
The data value will be represented as a ReinforcementSpacing.

Autodesk.Revit.DB.ParameterType.ReinforcementCover
The data value will be represented as a ReinforcementCover.

Autodesk.Revit.DB.ParameterType.ReinforcementAreaPerUnitLength
The data value will be represented as a ReinforcementAreaPerUnitLength.

Autodesk.Revit.DB.ParameterType.ReinforcementArea
The data value will be represented as a ReinforcementArea.

Autodesk.Revit.DB.ParameterType.Pulsation
The data value will be represented as a Pulsation.

Autodesk.Revit.DB.ParameterType.Period
The data value will be represented as a Period.

Autodesk.Revit.DB.ParameterType.SurfaceArea
The data value will be represented as a SurfaceArea.

Autodesk.Revit.DB.ParameterType.MomentOfInertia
The data value will be represented as a MomentOfInertia.

Autodesk.Revit.DB.ParameterType.MassPerUnitLength
The data value will be represented as a MassPerUnitLength.

Autodesk.Revit.DB.ParameterType.Mass
The data value will be represented as a Mass.

Autodesk.Revit.DB.ParameterType.StructuralFrequency
The data value will be represented as a StructuralFrequency.

Autodesk.Revit.DB.ParameterType.Energy
The data value will be represented as an Energy.

Autodesk.Revit.DB.ParameterType.DisplacementDeflection
The data value will be represented as a DisplacementDeflection.

Autodesk.Revit.DB.ParameterType.CrackWidth
The data value will be represented as a CrackWidth.

Autodesk.Revit.DB.ParameterType.BarDiameter
The data value will be represented as a BarDiameter.

Autodesk.Revit.DB.ParameterType.Acceleration
The data value will be represented as an Acceleration.

Autodesk.Revit.DB.ParameterType.HVACThermalMass
The data value will be represented as a HVACThermalMass.

Autodesk.Revit.DB.ParameterType.HVACThermalResistance
The data value will be represented as a HVACThermalResistance.

Autodesk.Revit.DB.ParameterType.PipeInsulationThickness
The data value will be represented as a PipeInsulationThickness.

Autodesk.Revit.DB.ParameterType.HVACDuctLiningThickness
The data value will be represented as a HVACDuctLiningThickness.

Autodesk.Revit.DB.ParameterType.HVACDuctInsulationThickness
The data value will be represented as a HVACDuctInsulationThickness.

Autodesk.Revit.DB.ParameterType.ElectricalDemandFactor
The data value will be represented as a ElectricalDemandFactor.

Autodesk.Revit.DB.ParameterType.ReinforcementLength
The data value will be represented as a ReinforcementLength.

Autodesk.Revit.DB.ParameterType.ReinforcementVolume
The data value will be represented as a ReinforcementVolume.

Autodesk.Revit.DB.ParameterType.ElectricalConduitSize
The data value will be represented as a ElectricalConduitSize.

Autodesk.Revit.DB.ParameterType.ElectricalCableTraySize
The data value will be represented as a ElectricalCableTraySize.

Autodesk.Revit.DB.ParameterType.ElectricalTemperature
The data value will be represented as a ElectricalTemperature.

Autodesk.Revit.DB.ParameterType.HVACFactor
The data value will be represented as a HVACFactor.

Autodesk.Revit.DB.ParameterType.HVACAreaDividedByHeatingLoad
The data value will be represented as a HVACAreaDividedByHeatingLoad.

Autodesk.Revit.DB.ParameterType.ElectricalLuminance
The data value will be represented as an ElectricalLuminance.

Autodesk.Revit.DB.ParameterType.ElectricalLuminousIntensity
The data value will be represented as an ElectricalLuminousIntensity.

Autodesk.Revit.DB.ParameterType.ColorTemperature
The data value will be represented as a ColorTemperature.

Autodesk.Revit.DB.ParameterType.ElectricalWattage
The data value will be represented as an ElectricalWattage.

Autodesk.Revit.DB.ParameterType.ElectricalEfficacy
The data value will be represented as an ElectricalEfficacy.

Autodesk.Revit.DB.ParameterType.Currency
The data value will be represented as a Currency.

Autodesk.Revit.DB.ParameterType.PipingSlope
The data value will be represented as a PipingSlope.

Autodesk.Revit.DB.ParameterType.HVACSlope
The data value will be represented as a HVACSlope.

Autodesk.Revit.DB.ParameterType.WireSize
The data value will be represented as a WireSize.

Autodesk.Revit.DB.ParameterType.HVACAreaDividedByCoolingLoad
The data value will be represented as a HVACAreaDividedByCoolingLoad.

Autodesk.Revit.DB.ParameterType.HVACAirflowDividedByCoolingLoad
The data value will be represented as a HVACAirflowDividedByCoolingLoad.

Autodesk.Revit.DB.ParameterType.HVACAirflowDividedByVolume
The data value will be represented as a HVACAirflowDividedByVolume.

Autodesk.Revit.DB.ParameterType.HVACHeatingLoadDividedByVolume
The data value will be represented as a HVACHeatingLoadDividedByVolume.

Autodesk.Revit.DB.ParameterType.HVACHeatingLoadDividedByArea
The data value will be represented as a HVACHeatingLoadDividedByArea.

Autodesk.Revit.DB.ParameterType.HVACHeatingLoad
The data value will be represented as a HVACHeatingLoad.

Autodesk.Revit.DB.ParameterType.HVACCoolingLoadDividedByVolume
The data value will be represented as a HVACCoolingLoadDividedByVolume.

Autodesk.Revit.DB.ParameterType.HVACCoolingLoadDividedByArea
The data value will be represented as a HVACCoolingLoadDividedByArea.

Autodesk.Revit.DB.ParameterType.HVACCoolingLoad
The data value will be represented as a HVACCoolingLoad.

Autodesk.Revit.DB.ParameterType.Slope
The data value will be represented as a Slope.

Autodesk.Revit.DB.ParameterType.HVACAirflowDensity
The data value will be represented as a HVACAirflowDensity.

Autodesk.Revit.DB.ParameterType.HVACCoefficientOfHeatTransfer
The data value will be represented as a HVACCoefficientOfHeatTransfer.

Autodesk.Revit.DB.ParameterType.HVACViscosity
The data value will be represented as a HVACViscosity.

Autodesk.Revit.DB.ParameterType.PipingVolume
The data value will be represented as a PipingVolume.

Autodesk.Revit.DB.ParameterType.AreaForcePerLength
The data value will be represented as an AreaForcePerLength.

Autodesk.Revit.DB.ParameterType.LinearForceLengthPerAngle
The data value will be represented as a LinearForceLengthPerAngle.

Autodesk.Revit.DB.ParameterType.LinearForcePerLength
The data value will be represented as a LinearForcePerLength.

Autodesk.Revit.DB.ParameterType.ForceLengthPerAngle
The data value will be represented as a ForceLengthPerAngle.

Autodesk.Revit.DB.ParameterType.ForcePerLength
The data value will be represented as a ForcePerLength.

Autodesk.Revit.DB.ParameterType.LinearMoment
The data value will be represented as a LinearMoment.

Autodesk.Revit.DB.ParameterType.ThermalExpansion
The data value will be represented as a ThermalExpansion.

Autodesk.Revit.DB.ParameterType.UnitWeight
The data value will be represented as a UnitWeight.

Autodesk.Revit.DB.ParameterType.Stress
The data value will be represented as a Stress.

Autodesk.Revit.DB.ParameterType.PipingRoughness
The data value will be represented as a PipingRoughness.

Autodesk.Revit.DB.ParameterType.PipeSize
The data value will be represented as a PipeSize.

Autodesk.Revit.DB.ParameterType.PipingViscosity
The data value will be represented as a PipingViscosity.

Autodesk.Revit.DB.ParameterType.PipingVelocity
The data value will be represented as a PipingVelocity.

Autodesk.Revit.DB.ParameterType.PipingTemperature
The data value will be represented as a PipingTemperature.

Autodesk.Revit.DB.ParameterType.PipingPressure
The data value will be represented as a PipingPressure.

Autodesk.Revit.DB.ParameterType.PipingFriction
The data value will be represented as a PipingFriction.

Autodesk.Revit.DB.ParameterType.PipingFlow
The data value will be represented as a PipingFlow.

Autodesk.Revit.DB.ParameterType.PipingDensity
The data value will be represented as a PipingDensity.

Autodesk.Revit.DB.ParameterType.ElectricalPowerDensity
The data value will be represented as an ElectricalPowerDensity.

Autodesk.Revit.DB.ParameterType.ElectricalApparentPower
The data value will be represented as an ElectricalApparentPower.

Autodesk.Revit.DB.ParameterType.HVACRoughness
The data value will be represented as a HVACRoughness.

Autodesk.Revit.DB.ParameterType.ElectricalPower
The data value will be represented as an ElectricalPower.

Autodesk.Revit.DB.ParameterType.ElectricalLuminousFlux
The data value will be represented as an ElectricalLuminousFlux.

Autodesk.Revit.DB.ParameterType.ElectricalIlluminance
The data value will be represented as an ElectricalIlluminance.

Autodesk.Revit.DB.ParameterType.ElectricalFrequency
The data value will be represented as an ElectricalFrequency.

Autodesk.Revit.DB.ParameterType.ElectricalPotential
The data value will be represented as an ElectricalPotential.

Autodesk.Revit.DB.ParameterType.ElectricalCurrent
The data value will be represented as an ElectricalCurrent.

Autodesk.Revit.DB.ParameterType.HVACHeatGain
The data value will be represented as a HVACHeatGain.

Autodesk.Revit.DB.ParameterType.HVACCrossSection
The data value will be represented as a HVACCrossSection.

Autodesk.Revit.DB.ParameterType.HVACDuctSize
The data value will be represented as a HVACDuctSize.

Autodesk.Revit.DB.ParameterType.HVACAirflow
The data value will be represented as a HVACAirflow.

Autodesk.Revit.DB.ParameterType.HVACVelocity
The data value will be represented as a HVACVelocity.

Autodesk.Revit.DB.ParameterType.HVACTemperature
The data value will be represented as a HVACTemperature.

Autodesk.Revit.DB.ParameterType.HVACPressure
The data value will be represented as a HVACPressure.

Autodesk.Revit.DB.ParameterType.HVACPowerDensity
The data value will be represented as a HVACPowerDensity.

Autodesk.Revit.DB.ParameterType.HVACPower
The data value will be represented as a HVACPower.

Autodesk.Revit.DB.ParameterType.HVACFriction
The data value will be represented as a HVACFriction.

Autodesk.Revit.DB.ParameterType.HVACEnergy
The data value will be represented as a HVACEnergy.

Autodesk.Revit.DB.ParameterType.HVACDensity
The data value will be represented as a HVACDensity.

Autodesk.Revit.DB.ParameterType.MultilineText
The value of this parameter will be represented as multiline text.

Autodesk.Revit.DB.ParameterType.Image
The value of this parameter is the id of an image.

Autodesk.Revit.DB.ParameterType.LoadClassification
A parameter value that represents the load classification units, as used in electrical disciplines.

Autodesk.Revit.DB.ParameterType.FamilyType
A parameter used to control the type of a family nested within another family.

Autodesk.Revit.DB.ParameterType.FixtureUnit
A parameter value that represents the fixture units, as used in piping disciplines.

Autodesk.Revit.DB.ParameterType.NumberOfPoles
A parameter value that represents the number of poles, as used in electrical disciplines.

Autodesk.Revit.DB.ParameterType.Moment
The data value will be represented as a moment.

Autodesk.Revit.DB.ParameterType.AreaForce
The data value will be represented as an area force.

Autodesk.Revit.DB.ParameterType.LinearForce
The data value will be represented as a linear force.

Autodesk.Revit.DB.ParameterType.Force
The data value will be represented as a force.

Autodesk.Revit.DB.ParameterType.YesNo
A boolean value that will be represented as Yes or No.

Autodesk.Revit.DB.ParameterType.Material
The value of this property is considered to be a material.

Autodesk.Revit.DB.ParameterType.URL
A text string that represents a web address.

Autodesk.Revit.DB.ParameterType.Angle
The parameter data represents an angle.

Autodesk.Revit.DB.ParameterType.Volume
The parameter data represents a volume.

Autodesk.Revit.DB.ParameterType.Area
The parameter data represents an area.

Autodesk.Revit.DB.ParameterType.Length
The parameter data represents a length.

Autodesk.Revit.DB.ParameterType.Number
The parameter data should be interpreted as a real number, possibly including decimal points.

Autodesk.Revit.DB.ParameterType.Integer
The parameter data should be interpreted as a whole number, positive or negative.

Autodesk.Revit.DB.ParameterType.Text
The parameter data should be interpreted as a string of text.

Autodesk.Revit.DB.ParameterType.Invalid
The parameter type is invalid. This value should not be used.